IDEA Open Model
SubStructureLoading Class
Compatible with IDEA StatiCa Beta 20.0
 SubStructureLoading
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.SubStructureLoading
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class SubStructureLoading : OpenObject
Public Class SubStructureLoading
	Inherits OpenObject
The SubStructureLoading type exposes the following members.
Constructors
Name | Description
SubStructureLoading
 Constructor
Top
Properties
Name | Description
LoadCases
 List of LoadCases
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace